bekencorp/armino/middleware/soc/bk7258/soc/sys_struct.h
typedef volatile union {
	struct {
		uint32_t wkgpiosel1                       :  4; /**<bit[0 : 3] */
		uint32_t rst_wks1v                        :  1; /**<bit[4 : 4] */
		uint32_t wkgpiosel2                       :  4; /**<bit[5 : 8] */
		uint32_t spi_latch1v                      :  1; /**<bit[9 : 9] */
		uint32_t digcurlim                        :  1; /**<bit[10 : 10] */
		uint32_t pupres_enb1v                     :  1; /**<bit[11 : 11] */
		uint32_t pdnres_en1v                      :  1; /**<bit[12 : 12] */
		uint32_t d_veasel1v                       :  2; /**<bit[13 : 14] */
		uint32_t ensfsdd                          :  1; /**<bit[15 : 15] */
		uint32_t vcorehsel                        :  4; /**<bit[16 : 19] */
		uint32_t vcorelsel                        :  3; /**<bit[20 : 22] */
		uint32_t vlden                            :  1; /**<bit[23 : 23] */
		uint32_t en_fast_coreldo                  :  1; /**<bit[24 : 24] */
		uint32_t pwdcoreldo                       :  1; /**<bit[25 : 25] */
		uint32_t vdighsel                         :  3; /**<bit[26 : 28] */
		uint32_t vdigsel                          :  2; /**<bit[29 : 30] */
		uint32_t vdd12lden                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg9_t;


typedef volatile union {
	struct {
		uint32_t pasoft_st                        :  4; /**<bit[0 : 3] */
		uint32_t azcdcnt_manu                     :  3; /**<bit[4 : 6] */
		uint32_t timer_sel                        :  4; /**<bit[7 : 10] */
		uint32_t vpabucksel                       :  4; /**<bit[11 : 14] */
		uint32_t spi_timerwken                    :  1; /**<bit[15 : 15] */
		uint32_t nc_16_16                         :  1; /**<bit[16 : 16] */
		uint32_t sd                               :  1; /**<bit[17 : 17] */
		uint32_t ioldosel                         :  1; /**<bit[18 : 18] */
		uint32_t iobyapssen                       :  1; /**<bit[19 : 19] */
		uint32_t ckfs                             :  2; /**<bit[20 : 21] */
		uint32_t ckintsel                         :  1; /**<bit[22 : 22] */
		uint32_t osccaltrig                       :  1; /**<bit[23 : 23] */
		uint32_t mroscsel                         :  1; /**<bit[24 : 24] */
		uint32_t mrosci_cal                       :  3; /**<bit[25 : 27] */
		uint32_t mrosccap_cal                     :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_ana_reg10_t;


typedef volatile union {
	struct {
		uint32_t sfsr                             :  4; /**<bit[0 : 3] */
		uint32_t ensfsaa                          :  1; /**<bit[4 : 4] */
		uint32_t apfms                            :  5; /**<bit[5 : 9] */
		uint32_t atmpo_sel                        :  2; /**<bit[10 : 11] */
		uint32_t ampoen                           :  1; /**<bit[12 : 12] */
		uint32_t enpowa                           :  1; /**<bit[13 : 13] */
		uint32_t avea_sel                         :  2; /**<bit[14 : 15] */
		uint32_t aforcepfm                        :  1; /**<bit[16 : 16] */
		uint32_t acls                             :  3; /**<bit[17 : 19] */
		uint32_t aswrsten                         :  1; /**<bit[20 : 20] */
		uint32_t aripc                            :  3; /**<bit[21 : 23] */
		uint32_t arampc                           :  4; /**<bit[24 : 27] */
		uint32_t arampcen                         :  1; /**<bit[28 : 28] */
		uint32_t aenburst                         :  1; /**<bit[29 : 29] */
		uint32_t apfmen                           :  1; /**<bit[30 : 30] */
		uint32_t aldosel                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg11_t;


typedef volatile union {
	struct {
		uint32_t buckd_softst                     :  4; /**<bit[0 : 3] */
		uint32_t dzcdcnt_manu                     :  3; /**<bit[4 : 6] */
		uint32_t clk_sel                          :  1; /**<bit[7 : 7] */
		uint32_t dpfms                            :  5; /**<bit[8 : 12] */
		uint32_t dtmpo_sel                        :  2; /**<bit[13 : 14] */
		uint32_t dmpoen                           :  1; /**<bit[15 : 15] */
		uint32_t dforcepfm                        :  1; /**<bit[16 : 16] */
		uint32_t dcls                             :  3; /**<bit[17 : 19] */
		uint32_t dswrsten                         :  1; /**<bit[20 : 20] */
		uint32_t dripc                            :  3; /**<bit[21 : 23] */
		uint32_t drampc                           :  4; /**<bit[24 : 27] */
		uint32_t drampcen                         :  1; /**<bit[28 : 28] */
		uint32_t denburst                         :  1; /**<bit[29 : 29] */
		uint32_t dpfmen                           :  1; /**<bit[30 : 30] */
		uint32_t dldosel                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg12_t;


typedef volatile union {
	struct {
		uint32_t pwdovp1v                         :  1; /**<bit[0 : 0] */
		uint32_t asoft_stc                        :  4; /**<bit[1 : 4] */
		uint32_t volen                            :  1; /**<bit[5 : 5] */
		uint32_t dpfms                            :  5; /**<bit[6 : 10] */
		uint32_t dtmpo_sel                        :  2; /**<bit[11 : 12] */
		uint32_t dmpoen                           :  1; /**<bit[13 : 13] */
		uint32_t pavea_sel                        :  2; /**<bit[14 : 15] */
		uint32_t dforcepfm                        :  1; /**<bit[16 : 16] */
		uint32_t dcls                             :  3; /**<bit[17 : 19] */
		uint32_t dswrsten                         :  1; /**<bit[20 : 20] */
		uint32_t dripc                            :  3; /**<bit[21 : 23] */
		uint32_t drampc                           :  4; /**<bit[24 : 27] */
		uint32_t drampcen                         :  1; /**<bit[28 : 28] */
		uint32_t paenburst                        :  1; /**<bit[29 : 29] */
		uint32_t papfmen                          :  1; /**<bit[30 : 30] */
		uint32_t enbuckpa                         :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg13_t;


typedef volatile union {
	struct {
		uint32_t reg                              : 10; /**<bit[0 : 9] */
		uint32_t en_adcmode                       :  1; /**<bit[10 : 10] */
		uint32_t en_out_test1v                    :  1; /**<bit[11 : 11] */
		uint32_t nc_12_12                         :  1; /**<bit[12 : 12] */
		uint32_t sel_seri_cap                     :  1; /**<bit[13 : 13] */
		uint32_t en_seri_cap                      :  1; /**<bit[14 : 14] */
		uint32_t cal_ctrl                         :  2; /**<bit[15 : 16] */
		uint32_t cal_vth                          :  3; /**<bit[17 : 19] */
		uint32_t crg                              :  2; /**<bit[20 : 21] */
		uint32_t vrefs                            :  4; /**<bit[22 : 25] */
		uint32_t gain_s                           :  4; /**<bit[26 : 29] */
		uint32_t td_latch1v                       :  1; /**<bit[30 : 30] */
		uint32_t pwd_td                           :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg14_t;


typedef volatile union {
	struct {
		uint32_t test_number1v                    :  4; /**<bit[0 : 3] */
		uint32_t test_period1v                    :  4; /**<bit[4 : 7] */
		uint32_t chs                              : 16; /**<bit[8 : 23] */
		uint32_t chs_sel_cal1v                    :  4; /**<bit[24 : 27] */
		uint32_t cal_done_clr1v                   :  1; /**<bit[28 : 28] */
		uint32_t en_cal_force1v                   :  1; /**<bit[29 : 29] */
		uint32_t en_cal_auto1v                    :  1; /**<bit[30 : 30] */
		uint32_t en_scan                          :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg15_t;


typedef volatile union {
	struct {
		uint32_t int_en                           : 16; /**<bit[0 : 15] */
		uint32_t int_en16                         :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t nc_18_18                         :  1; /**<bit[18 : 18] */
		uint32_t cal_number1v                     :  4; /**<bit[19 : 22] */
		uint32_t cal_period1v                     :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg16_t;


typedef volatile union {
	struct {
		uint32_t int_clr                          : 16; /**<bit[0 : 15] */
		uint32_t int_clr16                          :  1; /**<bit[16 : 16] */
		uint32_t ck_adc_sel                       :  1; /**<bit[17 : 17] */
		uint32_t int_clr_sel                      :  1; /**<bit[18 : 18] */
		uint32_t en_lpmod                         :  1; /**<bit[19 : 19] */
		uint32_t en_testcmp1v                     :  1; /**<bit[20 : 20] */
		uint32_t en_man_wr1v                      :  1; /**<bit[21 : 21] */
		uint32_t en_manmod1v                      :  1; /**<bit[22 : 22] */
		uint32_t cap_calspi1v                     :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg17_t;


typedef volatile union {
	struct {
		uint32_t iselaud                          :  1; /**<bit[0 : 0] */
		uint32_t audck_rlcen1v                    :  1; /**<bit[1 : 1] */
		uint32_t lchckinven1v                     :  1; /**<bit[2 : 2] */
		uint32_t enaudbias                        :  1; /**<bit[3 : 3] */
		uint32_t enadcbias                        :  1; /**<bit[4 : 4] */
		uint32_t enmicbias                        :  1; /**<bit[5 : 5] */
		uint32_t adcckinven1v                     :  1; /**<bit[6 : 6] */
		uint32_t dacfb2st0v9                      :  1; /**<bit[7 : 7] */
		uint32_t nc_8_8                           :  1; /**<bit[8 : 8] */
		uint32_t micbias_trm                      :  2; /**<bit[9 : 10] */
		uint32_t micbias_voc                      :  5; /**<bit[11 : 15] */
		uint32_t vrefsel1v                        :  1; /**<bit[16 : 16] */
		uint32_t capswspi                         :  5; /**<bit[17 : 21] */
		uint32_t adref_sel                        :  2; /**<bit[22 : 23] */
		uint32_t nc_24_25                         :  2; /**<bit[24 : 25] */
		uint32_t reserved_bit_26_30               :  5; /**<bit[26 : 30] */
		uint32_t spi_dacckpssel                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg18_t;


typedef volatile union {
	struct {
		uint32_t isel                             :  2; /**<bit[0 : 1] */
		uint32_t micirsel1                        :  1; /**<bit[2 : 2] */
		uint32_t micdacit                         :  2; /**<bit[3 : 4] */
		uint32_t micdacih                         :  8; /**<bit[5 : 12] */
		uint32_t micsingleen                      :  1; /**<bit[13 : 13] */
		uint32_t dccompen                         :  1; /**<bit[14 : 14] */
		uint32_t micgain                          :  4; /**<bit[15 : 18] */
		uint32_t micdacen                         :  1; /**<bit[19 : 19] */
		uint32_t stg2lsen1v                       :  1; /**<bit[20 : 20] */
		uint32_t openloopcal1v                    :  1; /**<bit[21 : 21] */
		uint32_t callatch                         :  1; /**<bit[22 : 22] */
		uint32_t vcmsel                           :  1; /**<bit[23 : 23] */
		uint32_t dwamode                          :  1; /**<bit[24 : 24] */
		uint32_t r2ren                            :  1; /**<bit[25 : 25] */
		uint32_t nc_26_27                         :  2; /**<bit[26 : 27] */
		uint32_t micen                            :  1; /**<bit[28 : 28] */
		uint32_t rst                              :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v                          :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg                         :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg19_t;


typedef volatile union {
	struct {
		uint32_t hpdac                            :  1; /**<bit[0 : 0] */
		uint32_t calcon_sel                       :  1; /**<bit[1 : 1] */
		uint32_t oscdac                           :  2; /**<bit[2 : 3] */
		uint32_t ocendac                          :  1; /**<bit[4 : 4] */
		uint32_t vcmsel                           :  1; /**<bit[5 : 5] */
		uint32_t adjdacref                        :  5; /**<bit[6 : 10] */
		uint32_t dcochg                           :  2; /**<bit[11 : 12] */
		uint32_t diffen                           :  1; /**<bit[13 : 13] */
		uint32_t endaccal                         :  1; /**<bit[14 : 14] */
		uint32_t nc_15_15                         :  1; /**<bit[15 : 15] */
		uint32_t lendcoc                          :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t lenvcmd                          :  1; /**<bit[18 : 18] */
		uint32_t dacdrven                         :  1; /**<bit[19 : 19] */
		uint32_t nc_20_20                         :  1; /**<bit[20 : 20] */
		uint32_t daclen                           :  1; /**<bit[21 : 21] */
		uint32_t dacg                             :  4; /**<bit[22 : 25] */
		uint32_t dacmute                          :  1; /**<bit[26 : 26] */
		uint32_t dacdwamode_sel                   :  1; /**<bit[27 : 27] */
		uint32_t dacsel                           :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_ana_reg20_t;


typedef volatile union {
	struct {
		uint32_t lmdcin                           :  8; /**<bit[0 : 7] */
		uint32_t nc_8_15                          :  8; /**<bit[8 : 15] */
		uint32_t spirst_ovc                       :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t enidacl                          :  1; /**<bit[18 : 18] */
		uint32_t dac3rdhc0v9                      :  1; /**<bit[19 : 19] */
		uint32_t hc2s                             :  1; /**<bit[20 : 20] */
		uint32_t rfb_ctrl                         :  1; /**<bit[21 : 21] */
		uint32_t vcmsel                           :  1; /**<bit[22 : 22] */
		uint32_t enbs                             :  1; /**<bit[23 : 23] */
		uint32_t calck_sel0v9                     :  1; /**<bit[24 : 24] */
		uint32_t bpdwa0v9                         :  1; /**<bit[25 : 25] */
		uint32_t looprst0v9                       :  1; /**<bit[26 : 26] */
		uint32_t oct0v9                           :  2; /**<bit[27 : 28] */
		uint32_t sout0v9                          :  1; /**<bit[29 : 29] */
		uint32_t hc0v9                            :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_ana_reg21_t;

typedef volatile struct {
	volatile sys_device_id_t device_id;
	volatile sys_version_id_t version_id;
	volatile sys_cpu_storage_connect_op_select_t cpu_storage_connect_op_select;
	volatile sys_cpu_current_run_status_t cpu_current_run_status;
	volatile sys_cpu0_int_halt_clk_op_t cpu0_int_halt_clk_op;
	volatile sys_cpu1_int_halt_clk_op_t cpu1_int_halt_clk_op;
	volatile sys_reserved_reg0x6_t reserved_reg0x6;
	volatile uint32_t rsv_7_7[1];
	volatile sys_cpu_clk_div_mode1_t cpu_clk_div_mode1;
	volatile sys_cpu_clk_div_mode2_t cpu_clk_div_mode2;
	volatile sys_cpu_26m_wdt_clk_div_t cpu_26m_wdt_clk_div;
	volatile sys_cpu_anaspi_freq_t cpu_anaspi_freq;
	volatile sys_cpu_device_clk_enable_t cpu_device_clk_enable;
	volatile sys_reserver_reg0xd_t reserver_reg0xd;
	volatile sys_cpu_device_mem_ctrl1_t cpu_device_mem_ctrl1;
	volatile sys_cpu_device_mem_ctrl2_t cpu_device_mem_ctrl2;
	volatile sys_cpu_power_sleep_wakeup_t cpu_power_sleep_wakeup;
	volatile sys_reserver_reg0x11_t reserver_reg0x11;
	volatile sys_cpu_device_mem_ctrl3_t cpu_device_mem_ctrl3;
	volatile uint32_t rsv_13_1f[13];
	volatile sys_cpu0_int_0_31_en_t cpu0_int_0_31_en;
	volatile sys_cpu0_int_32_63_en_t cpu0_int_32_63_en;
	volatile sys_cpu1_int_0_31_en_t cpu1_int_0_31_en;
	volatile sys_cpu1_int_32_63_en_t cpu1_int_32_63_en;
	volatile uint32_t rsv_24_27[4];
	volatile sys_cpu0_int_0_31_status_t cpu0_int_0_31_status;
	volatile sys_cpu0_int_32_63_status_t cpu0_int_32_63_status;
	volatile sys_cpu1_int_0_31_status_t cpu1_int_0_31_status;
	volatile sys_cpu1_int_32_63_status_t cpu1_int_32_63_status;
	volatile uint32_t rsv_2c_2f[4];
	volatile sys_gpio_config0_t gpio_config0;
	volatile sys_gpio_config1_t gpio_config1;
	volatile sys_gpio_config2_t gpio_config2;
	volatile sys_gpio_config3_t gpio_config3;
	volatile sys_gpio_config4_t gpio_config4;
	volatile sys_gpio_config5_t gpio_config5;
	volatile uint32_t rsv_36_37[2];
	volatile sys_sys_debug_config0_t sys_debug_config0;
	volatile sys_sys_debug_config1_t sys_debug_config1;
	volatile uint32_t rsv_3a_3f[6];
	volatile sys_ana_reg0_t ana_reg0;
	volatile sys_ana_reg1_t ana_reg1;
	volatile sys_ana_reg2_t ana_reg2;
	volatile sys_ana_reg3_t ana_reg3;
	volatile sys_ana_reg4_t ana_reg4;
	volatile sys_ana_reg5_t ana_reg5;
	volatile sys_ana_reg6_t ana_reg6;
	volatile sys_ana_reg7_t ana_reg7;
	volatile sys_ana_reg8_t ana_reg8;
	volatile sys_ana_reg9_t ana_reg9;
	volatile sys_ana_reg10_t ana_reg10;
	volatile sys_ana_reg11_t ana_reg11;
	volatile sys_ana_reg12_t ana_reg12;
	volatile sys_ana_reg13_t ana_reg13;
	volatile sys_ana_reg14_t ana_reg14;
	volatile sys_ana_reg15_t ana_reg15;
	volatile sys_ana_reg16_t ana_reg16;
	volatile sys_ana_reg17_t ana_reg17;
	volatile sys_ana_reg18_t ana_reg18;
	volatile sys_ana_reg19_t ana_reg19;
	volatile sys_ana_reg20_t ana_reg20;
	volatile sys_ana_reg21_t ana_reg21;
} sys_hw_t;

#ifdef __cplusplus
}
#endif
